import { mdiChevronLeft } from "@mdi/js";
import Icon from "@mdi/react";
import { useState } from "react";

function SPProIntroduction() {
  const [proIntroductionMore, setProIntroductionMore] = useState(false);

  return (
    <div id="product-prointroduction">
      <h4>بررسی تخصصی</h4>
      <div
        className={
          !proIntroductionMore ? "ellipces-collapse content" : "content"
        }
      >
        <h5>نگاهی به گوشی سامسونگ گلکسی A12</h5>
        <img src="/images/singleProduct/singleproduct-info-1.jpg" alt="" />
        <p>
          گوشی سامسونگ گلکسی A12 برای اولین بار در نوامبر 2020 معرفی شد که
          همانند مدل قبلی خود یعنی A11 یک گوشی مقرون‌به‌صرفه با کارایی متوسطی
          است. این گوشی دارای صفحه نمایش 6 اینچی همراه با چهار دوربین ماژول است.
          این مدل را باید جز گوشی‌های پایین رده سامسونگ دانست که نیازهای معمولی
          کاربران را برطرف می‌سازد.
        </p>
        <h6>طراحی و ساخت</h6>
        <p>
          گوشی گلکسی A12 با پوششی از پلاستیک بزرگ با طول 164 میلی‌متر و عرض 75.8
          میلی‌متر ساخته شده است. جلوی گوشی یک صفحه نمایش 6 اینچی با قابلیت IPS
          و رزولوشن 1600 × 720 پیکسل قرار دارد. طبق روال همیشه در قسمت بالای
          صفحه یک دوربین قرار گرفته و پایین صفحه تنها ادامه صفحه کشیده شده و
          دکمه‌ای وجود ندارد. دو طرفه و پشت گوشی از جنس پلاستیک یکسان پوشیده شده
          و جنس آن از پلاستیک مات است که وجود همچنین جنسی در گوشی‌های
          مقرون‌به‌صرفه امری معمول است. البته بدنه مات به راحتی جای اثر انگشت یا
          لکه را به خود نمی‌گیرد که از این جهت یک امتیاز مثبت محسوب می‌شود.
          استفاده از این نوع پلاستیک ظاهر زیبایی را به گوشی بخشیده است تا هنگام
          دست گرفتن آن احساس خاصی را داشته باشید.
        </p>
        <img src="/images/singleProduct/singleproduct-info-2.jpg" alt="" />
        <div className="d-flex">
          <p>
            در قسمت چپ گوشی اسلات MICROSD برای جای گذاری سیم کارت دیده می‌شود.
            گوشی گلکسی A12 از کارت‌های SD تا حجم 1 ترابایت پشتیبانی می‌کند. در
            قسمت دیگر آن دکمه کنترل صدا و حسگر اثر انگشت قرار دارد که نقش دکمه
            پاور را نیز ایفا می‌کند. سنسور گوشی از جهت شناخت سریع انگشت بسیار
            خوب عمل می‌کند.
          </p>
          <img src="/images/singleProduct/singleproduct-info-3.jpg" alt="" />
        </div>
        <div className="d-flex">
          <img src="/images/singleProduct/singleproduct-info-4.jpg" alt="" />
          <p>
            در نهایت، پایین گوشی دارای یک کانکتور USB Type-C و جک 3.5 میلی برای
            هدفون و بلندگو است. قدرت بلندگو در این گوشی بسیار معمولی است. همچنین
            شما می‌توانید با USB Type-C قرار گرفته؛ گوشی خود را حداکثر تا 15 وات
            شارژ کنید.
          </p>
        </div>
        <hr />
        <h6>صفحه نمایش</h6>
        <img src="/images/singleProduct/singleproduct-info-5.jpg" alt="" />
        <p>
          گوشی گلکسی A12 از معدود گوشی‌های تولیدی سامسونگ است که از صفحه نمایش
          OLED استفاده نمی‌کند و در مقابل از PLS IPS بهره می‌گیرد. اندازه 6.5
          اینچی آن در اندازه استاندار و درست است که از این حیث بسیار عالی است.
          بنابر اگر به دنبال یک ویژگی عالی در این گوشی هستید؛ به صفحه نمایش آن
          رجوع کنید.
        </p>
        <hr />
        <h6>نرم‌افزار</h6>
        <p>
          قابلیت‌های نرم‌افزاری این گوشی برخلاف سری‌های دیگر گلکسی چندان کاربران
          خود را شگفت‌زده نمی‌کند. A12 مجهز به اندروید 10 است و از رابط کاربری
          اختصاصی سامسونگ (One UI Core 2.5) استفاده می‌کند. البته باید گفت تمام
          امکانات One UI در این مدل به چشم نمی‌خورد. به طور مثال این رابط کاربری
          از Bixby، Good Lock، پوشه ایمنی و سرویس پرداخت سامسونگ پشتیبانی
          نمی‌کند.
        </p>
        <hr />
        <h6>باتری</h6>
        <img src="/images/singleProduct/singleproduct-info-6.jpg" alt="" />
        <p>
          گوشی گلکسی A12 از یک باتری 5000 میلی‌آمپر ساعتی تغذیه می‌کند که در این
          مورد قابل احترام است و نیازهای کاربران را از جهت شارژ برطرف می‌کند. با
          این گوشی می‌توان حداقل 16 ساعت وبگردی، یک ساعت تماشای فیلم آنلاین و
          بیش از 31 ساعت تماس تصویری برقرار کرد و در این زمینه بسیار عالی و با
          کیفیت عمل می‌کند. در نهایت باید گفت این گوشی دارای عمر باتری 123 ساعتی
          است.
        </p>
        <h6>اسپیکر</h6>
        <p>
          در مورد اسپیکرهای این گوشی حرف زیادی برای گفتن وجود ندارد. به طور کلی
          می‌توان گفت که بازپخش صدای خارج شده از آن کاملاً معمولی است و نمی‌توان
          انتظار مورد شگفت انگیزی از آن را داشت.
        </p>
        <hr />
        <h6>دوربین</h6>
        <img src="/images/singleProduct/singleproduct-info-7.jpg" alt="" />
        <p>
          A12 مجهز به 4 ماژول دوربین در پشت گوشی است که از نظر بسیاری از این
          چهار دوربین تنها دو دوربین واقعی هستند و عکاسی را انجام می‌دهند و دو
          دوبین تنها به جهت نمایش یا تزئین روی گوشی نصب شده است. با این حال
          دوربین‌های این گوشی 48 مگاپیسلی با فلش LED است. دوربین‌های این گوشی
          معمولی و ساده هستند که برای کارایی ساده مناسب هستند. قدرت زوم آن با
          کیفیت بوده و شما با زوم روی اجسام تصویر قابل قبولی دریافت خواهید کرد.
          همچنین عکس‌های که در نور روز گرفته می‌شوند با واضح هستند و جزئیات
          بسیار خوبی را در اختیار شما قرار می‌دهد. به جرات می‌توان گفت رنگ‌ها در
          گوشی A12 بسیار با دقت ثبت و نشان داده می‌شوند. اما عکس‌های گرفته شده
          در شب به اندازه روز روشن و واضح نیستند.
        </p>
        <h6>نتیجه‌گیری</h6>
        <p>
          گوشی سامسونگ گلکسی A12 را باید یک گوشی رده پایین در میان سری گوشی‌های
          گلکسی دانست که نیازهای حرفه‌ای کاربران خود را برطرف نمی‌سازد. اما
          همیشه این‌طور نیست که حرفه‌ای‌ها باید از گوشی استفاده کنند و در این
          میان باید افرادی را که به دنبال یک گوشی مقرون‌به‌صرفه اما کیفیت هستند
          را نیز مد نظر قرار داد. A12 دقیقاً یک گوشی مناسب برای افرادی است که
          انتظار امکانات خارق‌العاده‌ای از گوشی موبایل خود را ندارند و در این
          حال تمایل دارند گوشی آن‌ها از برندی پرچم و با کیفیت مناسب باشد. گوشی
          A12 انتظارات این افراد در سطح بسیار عالی برطرف می‌سازد.
        </p>
      </div>
      <button
        className="moreButtonStyle mt-2"
        onClick={() => {
          setProIntroductionMore(!proIntroductionMore);
        }}
      >
        {!proIntroductionMore ? "بیشتر" : "بستن"}
        <Icon path={mdiChevronLeft} size={1} />
      </button>
    </div>
  );
}

export default SPProIntroduction;
