import { mdiChevronLeft } from "@mdi/js";
import Icon from "@mdi/react";
import { useState } from "react";

function SPIntroduction() {
  const [introductionMore, setIntroductionMore] = useState(false);

  return (
    <div id="product-introduction">
      <h4>معرفی</h4>
      <div className={!introductionMore ? "ellipces-collapse" : ""}>
        گوشی A12 یکی دیگر از میان رده‌های شرکت سامسونگ است که در تاریخ 24 نوامبر
        2020 معرفی شد و بعد از آن نسخه‌ی Nacho این مدل در تاریخ 9 آگوست 2021 به
        بازار عرضه شد. شرکت سامسونگ برای این محصول خود از یک صفحه‌نمایش 6.5
        اینچی با رزولوشن 1600 در 720 پیکسل، استفاده کرده است. این صفحه‌نمایش در
        هر اینچ 270 پیکسل را نشان می‌دهد که از جزئیات و وضوح تصویر خوبی برخوردار
        است. تراشه‌ این محصول Exynos 850 از تراشه‌های 8 نانومتری سامسونگ است که
        با پردازنده مرکزی هشت هسته‌ای Cortex-A55 و پردازنده گرافیکی Mali-G52
        همراه شده است. این تراشه برای بازکردن چندین برنامه به‌صورت هم‌زمان و
        تماشای ویدئو مناسب است. این گوشی با 4 گیگابایت رم و 64 گیگابایت حافظه
        داخلی عرضه شده است و با قرار دادن یک کارت حافظه‌ی جانبی در شیار مجزایی
        که به همین منظور طراحی شده قادر خواهید بود میزان ظرفیت آن را افزایش
        دهید. بر روی قاب پشتی A12 یک دوربین چهارگانه قرار گرفته است. یک لنز عریض
        با رزولوشن 48 مگاپیکسل، یک لنز فوق عریض با رزولوشن 5 مگاپیکسل، یک لنز
        ماکرو با رزولوشن 2 مگاپیکسل و یک حسگر عمیق 2 مگاپیکسلی مجموعه دوربین A12
        را تشکیل می‌دهد. برای دوربین سلفی هم یک لنز 8 مگاپیکسلی از نوع عریض
        انتخاب شده است که در گوشه بالای صفحه‌نمایش قرار گرفته است. منبع انرژی
        گوشی A12 یک باتری لیتیوم-پلیمری با ظرفیت 5000 میلی‌آمپرساعت است که از
        فناوری شارژ سریع 15 واتی هم پشتیبانی می‌کند. شرکت سامسونگ این گوشی را با
        طراحی کاملاً مطلوب و امکانات فراوان به بازار عرضه کرده است تا در بازار
        میان‌رده‌ها هم حرفی برای گفتن داشته باشد.
      </div>
      <button
        className="moreButtonStyle mt-2"
        onClick={() => {
          setIntroductionMore(!introductionMore);
        }}
      >
        {!introductionMore ? "بیشتر" : "بستن"}
        <Icon path={mdiChevronLeft} size={1} />
      </button>
    </div>
  );
}

export default SPIntroduction;
